SourceWolf/HC32F460_FreeRTOS/HC32F460Temp_FreeRTOS/usb_lib/ctl_drv/usb_otg_regs.h
        /** TxFIFO Number (TxFNum) (Device and Host).
        *
        * This is the FIFO number which needs to be flushed,
        * using the TxFIFO Flush bit. This field should not
        * be changed until the TxFIFO Flush bit is cleared by
        * the core.
        *	 - 0x0 : Non Periodic TxFIFO Flush
        *	 - 0x1 : Periodic TxFIFO #1 Flush in device mode
        *	   or Periodic TxFIFO in host mode
        *	 - 0x2 : Periodic TxFIFO #2 Flush in device mode.
        *	 - ...
        *	 - 0xF : Periodic TxFIFO #15 Flush in device mode
        *	 - 0x10: Flush all the Transmit NonPeriodic and
        *	   Transmit Periodic FIFOs in the core
        */
        unsigned txfnum:5;
        /** Reserved */
        unsigned reserved11_29:19;
        /** DMA Request Signal.	 Indicated DMA request is in
        * probress. Used for debug purpose. */
        unsigned dmareq:1;
        /** AHB Master Idle.  Indicates the AHB Master State
        * Machine is in IDLE condition. */
        unsigned ahbidle:1;
    }
    b;
} USB_OTG_GRSTCTL_TypeDef;

typedef union _USB_OTG_GINTMSK_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned reserved0:1;
        unsigned modemismatch:1;
        unsigned reserved:1;
        unsigned sofintr:1;
        unsigned rxstsqlvl:1;
        unsigned nptxfempty:1;
        unsigned ginnakeff:1;
        unsigned goutnakeff:1;
        unsigned ulpickint:1;
        unsigned i2cintr:1;
        unsigned erlysuspend:1;
        unsigned usbsuspend:1;
        unsigned usbreset:1;
        unsigned enumdone:1;
        unsigned isooutdrop:1;
        unsigned eopframe:1;
        unsigned restoredone:1;
        unsigned epmismatch:1;
        unsigned inepintr:1;
        unsigned outepintr:1;
        unsigned incomplisoin:1;
        unsigned incomplisoout:1;
        unsigned fetsusp:1;
        unsigned resetdet:1;
        unsigned portintr:1;
        unsigned hcintr:1;
        unsigned ptxfempty:1;
        unsigned lpmtranrcvd:1;
        unsigned conidstschng:1;
        unsigned disconnect:1;
        unsigned vbusvint:1;
        unsigned wkupintr:1;
    }
    b;
} USB_OTG_GINTMSK_TypeDef;

typedef union _USB_OTG_GINTSTS_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned curmode:1;
        unsigned modemismatch:1;
        unsigned reserved:1;
        unsigned sofintr:1;
        unsigned rxstsqlvl:1;
        unsigned nptxfempty:1;
        unsigned ginnakeff:1;
        unsigned goutnakeff:1;
        unsigned ulpickint:1;
        unsigned i2cintr:1;
        unsigned erlysuspend:1;
        unsigned usbsuspend:1;
        unsigned usbreset:1;
        unsigned enumdone:1;
        unsigned isooutdrop:1;
        unsigned eopframe:1;
        unsigned restoredone:1;
        unsigned epmismatch:1;
        unsigned inepint:1;
        unsigned outepintr:1;
        unsigned incomplisoin:1;
        unsigned incomplisoout:1;
        unsigned fetsusp:1;
        unsigned resetdet:1;
        unsigned portintr:1;
        unsigned hcintr:1;
        unsigned ptxfempty:1;
        unsigned lpmtranrcvd:1;
        unsigned conidstschng:1;
        unsigned disconnect:1;
        unsigned vbusvint:1;
        unsigned wkupintr:1;
    }
    b;
} USB_OTG_GINTSTS_TypeDef ;
typedef union _USB_OTG_DRXSTS_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned epnum:4;
        unsigned bcnt:11;
        unsigned dpid:2;

#define DWC_STS_DATA_UPDT		0x2	// OUT Data Packet
#define DWC_STS_XFER_COMP		0x3	// OUT Data Transfer Complete

#define DWC_DSTS_GOUT_NAK		0x1	// Global OUT NAK
#define DWC_DSTS_SETUP_COMP		0x4	// Setup Phase Complete
#define DWC_DSTS_SETUP_UPDT 0x6	// SETUP Packet
        unsigned pktsts:4;
        unsigned fn:4;
        unsigned reserved25_31:7;
    }
    b;
} USB_OTG_DRXSTS_TypeDef;

typedef union _USB_OTG_GRXSTS_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned chnum:4;
        unsigned bcnt:11;
        unsigned dpid:2;

        unsigned pktsts:4;
#define DWC_GRXSTS_PKTSTS_IN			  0x2
#define DWC_GRXSTS_PKTSTS_IN_XFER_COMP	  0x3
#define DWC_GRXSTS_PKTSTS_DATA_TOGGLE_ERR 0x5
#define DWC_GRXSTS_PKTSTS_CH_HALTED		  0x7

        unsigned reserved21_31:11;
    }
    b;
} USB_OTG_GRXFSTS_TypeDef ;
typedef union _USB_OTG_FSIZ_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned startaddr:16;
        unsigned depth:16;
    }
    b;
} USB_OTG_FSIZ_TypeDef;

typedef union _USB_OTG_HNPTXSTS_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned nptxfspcavail:16;
        unsigned nptxqspcavail:8;
        /** Top of the Non-Periodic Transmit Request Queue
        *	- bit 24 - Terminate (Last entry for the selected
        *	  channel/EP)
        *	- bits 26:25 - Token Type
        *	  - 2'b00 - IN/OUT
        *	  - 2'b01 - Zero Length OUT
        *	  - 2'b10 - PING/Complete Split
        *	  - 2'b11 - Channel Halt
        *	- bits 30:27 - Channel/EP Number
        */
        unsigned nptxqtop_terminate:1;
        unsigned nptxqtop_token:2;
        unsigned nptxqtop_chnep:4;
        unsigned reserved:1;
    }
    b;
} USB_OTG_HNPTXSTS_TypeDef;

typedef union _USB_OTG_DTXFSTSn_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned txfspcavail:16;
        unsigned reserved:16;
    }
    b;
} USB_OTG_DTXFSTSn_TypeDef ;

typedef union _USB_OTG_GI2CCTL_TypeDef
{
    uint32_t d32;
    struct
    {
        unsigned rwdata:8;
        unsigned regaddr:8;
        unsigned addr:7;
        unsigned i2cen:1;
        unsigned ack:1;
        unsigned i2csuspctl:1;
        unsigned i2cdevaddr:2;
        unsigned i2cdatse0:1;
        unsigned reserved:1;
        unsigned rw:1;
        unsigned bsydne:1;
    }
    b;
} USB_OTG_GI2CCTL_TypeDef;

typedef union _USB_OTG_GPVNDCTL_TypeDef
{
	/** raw register data */
	uint32_t d32;
	/** register bits */
	struct {
		unsigned regdata:8;
		unsigned vctrl:8;
		unsigned regaddr16_21:6;
		unsigned regwr:1;
		unsigned reserved23_24:2;
		unsigned newregreq:1;
		unsigned vstsbsy:1;
		unsigned vstsdone:1;
		unsigned reserved28_30:3;
		unsigned disulpidrvr:1;
	} b;
} USB_OTG_GPVNDCTL_TypeDef;


typedef union _USB_OTG_DCFG_TypeDef
{
    uint32_t d32;
    struct
    {
        /** Device Speed */
        unsigned devspd:2;
        /** Non Zero Length Status OUT Handshake */
        unsigned nzstsouthshk:1;
#define DWC_DCFG_SEND_STALL 1

		unsigned ena32khzs:1;
		/** Device Addresses */
		unsigned devaddr:7;
		/** Periodic Frame Interval */
		unsigned perfrint:2;
#define DWC_DCFG_FRAME_INTERVAL_80 0
#define DWC_DCFG_FRAME_INTERVAL_85 1
#define DWC_DCFG_FRAME_INTERVAL_90 2
#define DWC_DCFG_FRAME_INTERVAL_95 3

		/** Enable Device OUT NAK for bulk in DDMA mode */
		unsigned endevoutnak:1;

		unsigned reserved14_17:4;
		/** In Endpoint Mis-match count */
		unsigned epmscnt:5;
		/** Enable Descriptor DMA in Device mode */
		unsigned descdma:1;
		unsigned perschintvl:2;
		unsigned resvalid:6;
    }
    b;
} USB_OTG_DCFG_TypeDef;

typedef union _USB_OTG_DCTL_TypeDef
{
    uint32_t d32;
    struct
    {
		/** Remote Wakeup */
		unsigned rmtwkupsig:1;
		/** Soft Disconnect */
		unsigned sftdiscon:1;
		/** Global Non-Periodic IN NAK Status */
		unsigned gnpinnaksts:1;
		/** Global OUT NAK Status */
		unsigned goutnaksts:1;
		/** Test Control */
		unsigned tstctl:3;
		/** Set Global Non-Periodic IN NAK */
		unsigned sgnpinnak:1;
		/** Clear Global Non-Periodic IN NAK */
		unsigned cgnpinnak:1;
		/** Set Global OUT NAK */
		unsigned sgoutnak:1;
		/** Clear Global OUT NAK */
		unsigned cgoutnak:1;
		/** Power-On Programming Done */
		unsigned pwronprgdone:1;
		/** Reserved */
		unsigned reserved:1;
		/** Global Multi Count */
		unsigned gmc:2;
		/** Ignore Frame Number for ISOC EPs */
		unsigned ifrmnum:1;
		/** NAK on Babble */
		unsigned nakonbble:1;
		/** Enable Continue on BNA */
		unsigned encontonbna:1;
		/** Enable deep sleep besl reject feature*/
		unsigned besl_reject:1;

		unsigned reserved17_31:13;
    }
    b;
} USB_OTG_DCTL_TypeDef;

typedef union _USB_OTG_DSTS_TypeDef
{
    uint32_t d32;
    struct
    {
		/** Suspend Status */
		unsigned suspsts:1;
		/** Enumerated Speed */
		unsigned enumspd:2;
#define DWC_DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ 0
#define DWC_DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ 1
#define DWC_DSTS_ENUMSPD_LS_PHY_6MHZ		   2
#define DWC_DSTS_ENUMSPD_FS_PHY_48MHZ		   3
		/** Erratic Error */
		unsigned errticerr:1;
		unsigned reserved4_7:4;
		/** Frame or Microframe Number of the received SOF */
		unsigned soffn:14;
		unsigned reserved22_31:10;
    }
    b;
} USB_OTG_DSTS_TypeDef;

typedef union _USB_OTG_DIEPINTn_TypeDef
{
    uint32_t d32;
    struct
    {
		/** Transfer complete mask */
		unsigned xfercompl:1;
		/** Endpoint disable mask */
		unsigned epdisabled:1;
		/** AHB Error mask */
		unsigned ahberr:1;
		/** TimeOUT Handshake mask (non-ISOC EPs) */
		unsigned timeout:1;
		/** IN Token received with TxF Empty mask */
		unsigned intktxfemp:1;
		/** IN Token Received with EP mismatch mask */
		unsigned intknepmis:1;
		/** IN Endpoint NAK Effective mask */
		unsigned inepnakeff:1;
		/** Reserved */
		unsigned emptyintr:1;

		unsigned txfifoundrn:1;

